
## Plan Result (prod)




<pre><code>Plan: 1 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.finalsa_storage_account_primary_access_key
* Update
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.vodasa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.finalsa_storage_account_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "finalsa_storage_account_primary_access_key" {
      + expiration_date         = "2025-06-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.KeyVault/vaults/pre-hmctskv-prod"
      + name                    = "finalsa-storage-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine_extension.edit_init[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "edit_init" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod/extensions/toolingScript"
        name                        = "toolingScript"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (8 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.vodasa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prevodasaprod"
        name                               = "prevodasaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":971,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->